# ---- Шаг 1: Базовый образ ----
# Берем легковесный официальный образ Python. Slim значит без лишних тулзов.
FROM python:3.11-slim

# ---- Шаг 2: Рабочая директория ----
# Все команды дальше будут выполняться внутри папки /app в контейнере
WORKDIR /app

# ---- Шаг 3: Зависимости ----
# Сначала копируем ТОЛЬКО файл с зависимостями.
# Это нужно для кеширования слоев Docker.
# Если код изменился, а зависимости нет, Docker не будет переустанавливать их заново.
COPY requirements.txt .

# Устанавливаем зависимости. --no-cache-dir уменьшает размер образа.
RUN pip install --no-cache-dir -r requirements.txt

# ---- Шаг 4: Код приложения ----
# Теперь копируем сам скрипт
COPY healthcheck.py .

# ---- Шаг 5: Пользователь (Безопасность) ----
# Не запускаем приложение от root внутри контейнера!
RUN adduser --disabled-password --gecos '' appuser
USER appuser

# ---- Шаг 6: Команда запуска ----
# CMD как правило не переопределяется при docker run (в отличие от ENTRYPOINT)
CMD ["python", "healthcheck.py"]
